Configuration_project_01/src/DataProcessors/АЭС_ВыгрузкаРеестраПлатежей/АЭС_ВыгрузкаРеестраПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АЭС_ВыгрузкаРеестраПлатежей</name>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеПоПартнеру</name>
    <attributes>
      <name>ПолеИсточник</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолеПриемник</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПоля</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаПоля</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обработать</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Configuration_project_01/src/InformationRegisters/АЭС_ДанныеКонтрагентов/АЭС_ДанныеКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АЭС_ДанныеКонтрагентов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПризнакОплатыПоСчетчику</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоследниеПоказания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнейОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Задолженность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Начислено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Configuration_project_01/src/InformationRegisters/АЭС_КомиссияНоменклатуры/АЭС_КомиссияНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АЭС_КомиссияНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>НоменклатураКомиссии</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>ВидОплатыКомиссии</name>
    <type>
      <types>CatalogRef.АЭС_ВидОплаты</types>
    </type>
  </resources>
  <resources>
    <name>ПроцентКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Макс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдержаниеИзСуммыПеричисления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОплаты</name>
    <type>
      <types>CatalogRef.АЭС_ВидОплаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособРасчетаКомиссии</name>
    <type>
      <types>EnumRef.АЭС_СпособоРасчетаКомиссии</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Configuration_project_01/src/InformationRegisters/АЭС_НастройкаВыгрузкиПлатежей/АЭС_НастройкаВыгрузкиПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АЭС_НастройкаВыгрузкиПлатежей</name>
  <resources>
    <name>ПолеИсточник</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Обработать</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПолеПриемник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПоля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДлинаПоля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Configuration_project_01/src/Enums/АЭС_СпособоРасчетаКомиссии/АЭС_СпособоРасчетаКомиссии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>АЭС_СпособоРасчетаКомиссии</name>
  <enumValues>
    <name>ФиксированнаяСумма</name>
  </enumValues>
  <enumValues>
    <name>ПроцентОтСуммы</name>
  </enumValues>
</mdclass:Enum>

Configuration_project_01/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <predefined>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <comment>Реквизит введен для совместимости с Библиотекой типов и не выводится в пользовательский интерфейс. Заполняется автоматически по данным реквизита ЮрФизЛицо.</comment>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСПоСтавкам4и2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдДоговораЮЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеМеждународное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКПП</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияНаименований</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПолное</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Configuration_project_01/src/DataProcessors/АЭС_ВыгрузкаРеестраПлатежей/Forms/Форма/Module.bsl
&НаСервере
Процедура ВыгрузитьНаСервере(БД, НаборДанных)	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |" + НаборДанных + " 
	               |ИЗ
	               |	Документ.АЭС_Платежи.СторонниеУслуги КАК Источник
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМВозврат КАК ЧекККМВозврат
	               |		ПО Источник.ДокументПродажи = ЧекККМВозврат.ЧекККМ
         		   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АЭС_ДанныеКонтрагентов.СрезПоследних(&КонПериода, ) КАК ДанныеКонтрагента
              	   |		ПО Источник.Ссылка.Контрагент = ДанныеКонтрагента.Контрагент
            	   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АЭС_КомиссияНоменклатуры.СрезПоследних КАК Комиссия
       		       |		ПО Источник.Ссылка.Партнер = Комиссия.Партнер
               	   |			И Источник.Ссылка.Организация = Комиссия.Организация
               	   |			И Источник.Номенклатура = Комиссия.Номенклатура
	               |ГДЕ
	               |	Источник.Ссылка.Статус = ЗНАЧЕНИЕ(перечисление.СтатусыЧековККМ.Пробит)
	               |	И Источник.Ссылка.Дата МЕЖДУ &НачПериода И &КонПериода
	               |	И Источник.Ссылка.Организация = &Организация
	               |	И Источник.Ссылка.Возврат = ЛОЖЬ
	               |	И Источник.Ссылка.Проведен = ИСТИНА
	               |	И Источник.Ссылка.Партнер = &Партнер
	               |	И (НЕ ЧекККМВозврат.Статус = ЗНАЧЕНИЕ(перечисление.СтатусыЧековККМ.Пробит)
	               |			ИЛИ ЧекККМВозврат.Ссылка ЕСТЬ NULL)
				   |	#ДопУсловие# ";
	
	
	Запрос.УстановитьПараметр("НачПериода", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("КонПериода", КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
	ДопУсловие = "";
	Если ЗначениеЗаполнено(Объект.Номенклатура) тогда
		ДопУсловие = ДопУсловие+" И Источник.Номенклатура = &Номенклатура";
		Запрос.УстановитьПараметр("Номенклатура", Объект.Номенклатура);
	КонецЕсли;
	Если ЗначениеЗаполнено(ВидДокумента) Тогда
		ДопУсловие =  ДопУсловие+" И Источник.Приимечание = &Приимечание";
		Запрос.УстановитьПараметр("Приимечание", ВидДокумента);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.КассаККМ) Тогда 
		ДопУсловие = ДопУсловие+" И Источник.Ссылка.КассаККМ = &КассаККМ";
		Запрос.УстановитьПараметр("КассаККМ", Объект.КассаККМ);
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ДопУсловие#", ДопУсловие);	
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СТЗ Из Результат Цикл
		Данные = Новый Структура;
		Для Каждого СТЧ Из Объект.ДанныеПоПартнеру Цикл
			Если Не ЗначениеЗаполнено(СТЧ.ПолеПриемник) Тогда
				Продолжить;
			КонецЕсли;
			Если ЗначениеЗаполнено(СТЧ.Обработать) Тогда  

				Попытка
					Данные.Вставить(СТЧ.ПолеПриемник, Вычислить(СТЧ.Обработать));
				Исключение
					Сообщить("При выгрузке произошла ошибка. Обратитесь к системному администратору");
				КонецПопытки;
			Иначе
				Данные.Вставить(СТЧ.ПолеПриемник, СТЗ[СТЧ.ПолеПриемник]);
			КонецЕсли;
		КонецЦикла;
		БД.Добавить(Данные);
	КонецЦикла;
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Функция ПолучитьКД(Контрагент, Тип)
	РезультатыЧтения = Новый Структура;	
	ЗначенияПолей = Контрагент.КонтактнаяИнформация[0].ЗначенияПолей;
	Если УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВJSON(ЗначенияПолей) Тогда
		ДанныеАдреса = УправлениеКонтактнойИнформациейСлужебный.СтрокаJSONВСтруктуру(ЗначенияПолей);
		НаселенныйПунктДетально = РаботаСАдресами.ПодготовитьАдресДляВвода(ДанныеАдреса);
	Иначе
		XDTOКонтактная = ИзвлечьСтарыйФорматАдреса(ЗначенияПолей, Перечисления.ТипыКонтактнойИнформации.Адрес);
		ДанныеАдреса = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияВСтруктуруJSON(XDTOКонтактная, Перечисления.ТипыКонтактнойИнформации.Адрес);
		НаселенныйПунктДетально = РаботаСАдресами.ПодготовитьАдресДляВвода(ДанныеАдреса);
		//XDTOКонтактная = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияИзXML(ЗначенияПолей, Перечисления.ТипыКонтактнойИнформации.Адрес, РезультатыЧтения);
	КонецЕсли;
	
	Если Тип = "Индекс" Тогда
		Возврат НаселенныйПунктДетально.ZIPcode;
	ИначеЕсли  Тип = "Область" Тогда
		Область = НаселенныйПунктДетально.area + " " + НаселенныйПунктДетально.areaType;
		Возврат Область;
	ИначеЕсли Тип = "Район" Тогда
		Район = НаселенныйПунктДетально.district + " " + НаселенныйПунктДетально.districtType;
		Возврат Район;
	ИначеЕсли Тип = "ПаселенныйПункт" Тогда
		Если ЗначениеЗаполнено(НаселенныйПунктДетально.city) Тогда
			ПаселенныйПункт = НаселенныйПунктДетально.cityType + " " + НаселенныйПунктДетально.city; 
		Иначе
			ПаселенныйПункт = НаселенныйПунктДетально.localityType + " " + НаселенныйПунктДетально.locality; 
		КонецЕсли;
		Возврат ПаселенныйПункт; 
	ИначеЕсли Тип = "Улица" Тогда 
		Улица = НаселенныйПунктДетально.streetType + " " + НаселенныйПунктДетально.street;
		Возврат Улица;
	ИначеЕсли Тип = "Дом" Тогда
		Дом =  НаселенныйПунктДетально.housenumber;
		Для Каждого СТРМ Из НаселенныйПунктДетально.buildings Цикл 
			Дом = Дом + " " + СТРМ.type + " " + СТРМ.number;	
		КонецЦикла;
		Возврат Дом;
	ИначеЕсли Тип = "Квартира" Тогда
		Квартира = НаселенныйПунктДетально.apartments[0].number;
		Возврат Квартира;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура Выгрузить(Команда)
	Если Объект.ДанныеПоПартнеру.Количество()=0 Тогда
		ПартнерПриИзмененииНаСервере();
	КонецЕсли;
	НаборДанных = "";
	БД = Новый XBase;
	Для Каждого СТЧ Из Объект.ДанныеПоПартнеру Цикл 
		Если ЗначениеЗаполнено(СТЧ.ПолеПриемник) Тогда 
			БД.Поля.Добавить(СТЧ.ПолеПриемник,		СТЧ.ТипПоля, Цел(СТЧ.ДлинаПоля), Число(Прав(СТЧ.ДлинаПоля-Цел(СТЧ.ДлинаПоля),1)));
			Если Объект.ДанныеПоПартнеру.Количество() = СТЧ.НомерСтроки Тогда  
				НаборДанных = НаборДанных + СТЧ.ПолеИсточник + " КАК " +СТЧ.ПолеПриемник; 
			Иначе
				НаборДанных = НаборДанных + СТЧ.ПолеИсточник+ " КАК " +СТЧ.ПолеПриемник+"," + Символы.ПС; 
			КонецЕсли;
		Иначе
			Если Объект.ДанныеПоПартнеру.Количество() = СТЧ.НомерСтроки Тогда  
				НаборДанных = НаборДанных + СТЧ.ПолеИсточник; 
			Иначе
				НаборДанных = НаборДанных + СТЧ.ПолеИсточник+"," + Символы.ПС; 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
	ИмяФайла = ПолучитьИмяФайла(); 
	Если ИмяФайла = Неопределено Тогда
		ИмяФайла = "AES"+"_"+Формат(Объект.Дата, "ДФ=ддММ");
	Иначе
		ИмяФайла = Вычислить(ИмяФайла);
	КонецЕсли;
	
	БД.АвтоСохранение = Истина;
	БД.СоздатьФайл(?(Прав(Объект.ПутьКФайлу,1)="\",Объект.ПутьКФайлу+ИмяФайла,Объект.ПутьКФайлу+"\"+ИмяФайла));
	БД.Кодировка=КодировкаXBase.OEM;
	
	МассивДанных =Новый Массив;
	ВыгрузитьНаСервере(МассивДанных, НаборДанных);
	
	Для Каждого СТР из МассивДанных Цикл
		БД.Добавить();
		ЗаполнитьЗначенияСвойств(БД,СТР);
		
		//Если СТР.Свойство("NOM_PP") Тогда
		//	БД.NOM_PP = НомерПП;
		//КонецЕсли;
	КонецЦикла;
	БД.ЗакрытьФайл();
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбора.Заголовок = "Выберите файл";

	ДиалогВыбора.ПолноеИмяФайла = "";
    Текст = "ru = ""Текст""; en = ""Text""";
    Фильтр = "ДБФ (*.dbf)|*.dbf";
    ДиалогВыбора.Фильтр = Фильтр;
    ДиалогВыбора.МножественныйВыбор = Ложь;

	Если ДиалогВыбора.Выбрать() Тогда
		Объект.ПутьКФайлу = ДиалогВыбора.Каталог;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПартнерПриИзмененииНаСервере()
	Если Объект.ДанныеПоПартнеру.Количество()>0 Тогда
		Объект.ДанныеПоПартнеру.Очистить();
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АЭС_НастройкаВыгрузкиПлатежей.ПолеИсточник,
	               |	АЭС_НастройкаВыгрузкиПлатежей.ПолеПриемник,
	               |	АЭС_НастройкаВыгрузкиПлатежей.ТипПоля,
	               |	АЭС_НастройкаВыгрузкиПлатежей.ДлинаПоля,
	               |	АЭС_НастройкаВыгрузкиПлатежей.Обработать
	               |ИЗ
	               |	РегистрСведений.АЭС_НастройкаВыгрузкиПлатежей КАК АЭС_НастройкаВыгрузкиПлатежей
	               |ГДЕ
	               |	АЭС_НастройкаВыгрузкиПлатежей.Партнер = &Партнер
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	АЭС_НастройкаВыгрузкиПлатежей.Порядок";
	
	Запрос.УстановитьПараметр("Партнер",Объект.Партнер);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ДанныеПоПартнеру.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	// Вставить содержимое обработчика.
КонецФункции

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	ПартнерПриИзмененииНаСервере();
КонецПроцедуры

Процедура П()
Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
               |	Источник.Ссылка КАК Ссылка,
               |	ГОД(Источник.ПериодПлатежа) - 2000 КАК Поле1,
               |	ВЫБОР
               |		КОГДА Комиссия.УдержаниеИзСуммыПеричисления
               |			ТОГДА ВЫБОР
               |					КОГДА Комиссия.СпособРасчетаКомиссии = ЗНАЧЕНИЕ(Перечисление.АЭС_СпособоРасчетаКомиссии.ФиксированнаяСумма)
               |						ТОГДА Источник.Сумма - Комиссия.Мин
               |					ИНАЧЕ ВЫБОР
               |							КОГДА Источник.Сумма - (ВЫРАЗИТЬ(Источник.Сумма / 100 * Комиссия.ПроцентКомиссии КАК ЧИСЛО)) < Комиссия.Мин и Комиссия.Мин<>0
               |								ТОГДА Комиссия.Мин
               |							КОГДА Источник.Сумма - (ВЫРАЗИТЬ(Источник.Сумма / 100 * Комиссия.ПроцентКомиссии КАК ЧИСЛО)) > Комиссия.Макс и Комиссия.Макс<>0

               |								ТОГДА Комиссия.Макс
               |							ИНАЧЕ Источник.Сумма - (ВЫРАЗИТЬ(Источник.Сумма / 100 * Комиссия.ПроцентКомиссии КАК ЧИСЛО))
               |						КОНЕЦ
               |				КОНЕЦ
               |	КОНЕЦ КАК Сумма
               |ИЗ
               |	Документ.АЭС_Платежи.СторонниеУслуги КАК Источник
               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМВозврат КАК ЧекККМВозврат
               |		ПО Источник.ДокументПродажи = ЧекККМВозврат.ЧекККМ
               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АЭС_ДанныеКонтрагентов.СрезПоследних(&КонПериода, ) КАК ДанныеКонтрагента
               |		ПО Источник.Ссылка.Контрагент = ДанныеКонтрагента.Контрагент
               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АЭС_КомиссияНоменклатуры.СрезПоследних КАК Комиссия
               |		ПО Источник.Ссылка.Партнер = Комиссия.Партнер
               |			И Источник.Ссылка.Организация = Комиссия.Организация
               |			И Источник.Ссылка.КассаККМ = Комиссия.Номенклатура
               |ГДЕ
               |	Источник.Ссылка.Статус = ЗНАЧЕНИЕ(перечисление.СтатусыЧековККМ.Пробит)
               |	И Источник.Ссылка.Дата МЕЖДУ &НачПериода И &КонПериода
               |	И Источник.Ссылка.Организация = &Организация
               |	И Источник.Ссылка.Возврат = ЛОЖЬ
               |	И Источник.Ссылка.Проведен = ИСТИНА
               |	И Источник.Ссылка.Партнер = &Партнер
               |	И (НЕ ЧекККМВозврат.Статус = ЗНАЧЕНИЕ(перечисление.СтатусыЧековККМ.Пробит)
               |			ИЛИ ЧекККМВозврат.Ссылка ЕСТЬ NULL)
               |	И Источник.Номенклатура = &Номенклатура
               |	И Источник.Приимечание = &Приимечание";

Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.Дата = ТекущаяДата();
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбновитьСписокПартнеров();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПартнеров()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Партнер
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.Организация = &Организация
	               |	И ДоговорыКонтрагентов.Контрагент = &Контрагент
	               |	И ДоговорыКонтрагентов.ДатаНачалаДействия <= &ДатаНачалаДействия
	               |	И ДоговорыКонтрагентов.ДатаОкончанияДействия >= &ДатаОкончанияДействия";

	Запрос.УстановитьПараметр("Организация", Объект.Организация );
	Запрос.УстановитьПараметр("Контрагент", Справочники.Контрагенты.РозничныйПокупатель);
	Запрос.УстановитьПараметр("ДатаНачалаДействия", ТекущаяДата());
	Запрос.УстановитьПараметр("ДатаОкончанияДействия", ТекущаяДата());

	Результат = Запрос.Выполнить().Выгрузить();
	РезМассив = Результат.ВыгрузитьКолонку("Партнер");
	Возврат РезМассив;
КонецФункции

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОбновитьСписокПартнеров();	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокПартнеров()
	СписокПартнеров = ПолучитьСписокПартнеров();
	Элементы.Партнер.СписокВыбора.ЗагрузитьЗначения(СписокПартнеров);
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяФайла()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПартнерыДополнительныеРеквизиты.Значение
	               |ИЗ
	               |	Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
	               |ГДЕ
	               |	ПартнерыДополнительныеРеквизиты.Ссылка = &Партнер
	               |	И ПартнерыДополнительныеРеквизиты.Свойство.Заголовок = ""ИмяФайла""";
	
	Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если  Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	Иначе			
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

&НаСервере
Функция ИзвлечьСтарыйФорматАдреса(Знач ЗначенияПолей, Знач ТипКонтактнойИнформации) Экспорт
	
	Перем XDTOКонтактная, РезультатыЧтения;
	
	Если УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВXML(ЗначенияПолей)
		И ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
		РезультатыЧтения = Новый Структура;
		XDTOКонтактная = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияИзXML(ЗначенияПолей, ТипКонтактнойИнформации, РезультатыЧтения);
		Если РезультатыЧтения.Свойство("ТекстОшибки") Тогда
			// Распознали с ошибками, сообщим при открытии.
			ТекстПредупрежденияПриОткрытии = РезультатыЧтения.ТекстОшибки;
			XDTOКонтактная.Представление   = Параметры.Представление;
			XDTOКонтактная.Состав.Страна   = Строка(Справочники.СтраныМира.Россия);
		КонецЕсли;
	Иначе
		XDTOКонтактная = УправлениеКонтактнойИнформациейСлужебный.АдресXMLВXDTO(ЗначенияПолей, Параметры.Представление, );
		Если Параметры.Свойство("Страна") И ЗначениеЗаполнено(Параметры.Страна) Тогда
			Если ТипЗнч(Параметры.Страна) = ТипЗнч(Справочники.СтраныМира.ПустаяСсылка()) Тогда
				XDTOКонтактная.Состав.Страна = Параметры.Страна.Наименование;
			Иначе
				XDTOКонтактная.Состав.Страна = Строка(Параметры.Страна);
			КонецЕсли;
		Иначе
			XDTOКонтактная.Состав.Страна = Справочники.СтраныМира.Россия.Наименование;
		КонецЕсли;
	КонецЕсли;
	Возврат XDTOКонтактная;

КонецФункции
